[SilentTakedown X2AbilityTemplate]
LocFriendlyName="Silent Takedown"
LocLongDescription="You can silently takedown your enemies. When activated you have no detection radius for one round. Melee attacks have a chance to not break your concealment and you have +10 critical hit chance and +3 critical damage (melee only). Can only be activated while concealed."
LocHelpText="You can silently takedown your enemies. When activated you have no detection radius for one round. Melee attacks have a chance to not break your concealment and you have +10 critical hit chance and +3 critical damage (melee only). Can only be activated while concealed."
LocFlyOverText="Silent Takedown" 
LocPromotionPopupText="<Bullet/>You have no detection radius for one round (xcom turn).\n<Bullet\>Melee attacks have a chance to not break your concealment.\n<Bullet\>+10 critical hit chance and +3 critical damage (melee only).\n<Bullet\>Can only be activated while concealed.\n<Bullet\>Killing the target divide the chance of revealment in half, if no other enemies sees the kill the chance is only 10%."
